KomplexKapharnaum/STM32_ESP32_firmware/hardware/kxkm/stm32/boards.txt
Disco.menu.opt.osstd=Smallest (-Os default)
Disco.menu.opt.osstd.build.flags.optimize=-Os
Disco.menu.opt.osstd.build.flags.ldspecs=
Disco.menu.opt.oslto=Smallest (-Os) with LTO
Disco.menu.opt.oslto.build.flags.optimize=-Os -flto
Disco.menu.opt.oslto.build.flags.ldspecs=-flto
Disco.menu.opt.o1std=Fast (-O1)
Disco.menu.opt.o1std.build.flags.optimize=-O1
Disco.menu.opt.o1std.build.flags.ldspecs=
Disco.menu.opt.o1lto=Fast (-O1) with LTO
Disco.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Disco.menu.opt.o1lto.build.flags.ldspecs=-flto
Disco.menu.opt.o2std=Faster (-O2)
Disco.menu.opt.o2std.build.flags.optimize=-O2
Disco.menu.opt.o2std.build.flags.ldspecs=
Disco.menu.opt.o2lto=Faster (-O2) with LTO
Disco.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Disco.menu.opt.o2lto.build.flags.ldspecs=-flto
Disco.menu.opt.o3std=Fastest (-O3)
Disco.menu.opt.o3std.build.flags.optimize=-O3
Disco.menu.opt.o3std.build.flags.ldspecs=
Disco.menu.opt.o3lto=Fastest (-O3) with LTO
Disco.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Disco.menu.opt.o3lto.build.flags.ldspecs=-flto
Disco.menu.opt.ogstd=Debug (-g)
Disco.menu.opt.ogstd.build.flags.optimize=-g -Og
Disco.menu.opt.ogstd.build.flags.ldspecs=

GenF103.menu.opt.osstd=Smallest (-Os default)
GenF103.menu.opt.osstd.build.flags.optimize=-Os
GenF103.menu.opt.osstd.build.flags.ldspecs=
GenF103.menu.opt.oslto=Smallest (-Os) with LTO
GenF103.menu.opt.oslto.build.flags.optimize=-Os -flto
GenF103.menu.opt.oslto.build.flags.ldspecs=-flto
GenF103.menu.opt.o1std=Fast (-O1)
GenF103.menu.opt.o1std.build.flags.optimize=-O1
GenF103.menu.opt.o1std.build.flags.ldspecs=
GenF103.menu.opt.o1lto=Fast (-O1) with LTO
GenF103.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenF103.menu.opt.o1lto.build.flags.ldspecs=-flto
GenF103.menu.opt.o2std=Faster (-O2)
GenF103.menu.opt.o2std.build.flags.optimize=-O2
GenF103.menu.opt.o2std.build.flags.ldspecs=
GenF103.menu.opt.o2lto=Faster (-O2) with LTO
GenF103.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenF103.menu.opt.o2lto.build.flags.ldspecs=-flto
GenF103.menu.opt.o3std=Fastest (-O3)
GenF103.menu.opt.o3std.build.flags.optimize=-O3
GenF103.menu.opt.o3std.build.flags.ldspecs=
GenF103.menu.opt.o3lto=Fastest (-O3) with LTO
GenF103.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenF103.menu.opt.o3lto.build.flags.ldspecs=-flto
GenF103.menu.opt.ogstd=Debug (-g)
GenF103.menu.opt.ogstd.build.flags.optimize=-g -Og
GenF103.menu.opt.ogstd.build.flags.ldspecs=

Maple.menu.opt.osstd=Smallest (-Os default)
Maple.menu.opt.osstd.build.flags.optimize=-Os
Maple.menu.opt.osstd.build.flags.ldspecs=
Maple.menu.opt.oslto=Smallest (-Os) with LTO
Maple.menu.opt.oslto.build.flags.optimize=-Os -flto
Maple.menu.opt.oslto.build.flags.ldspecs=-flto
Maple.menu.opt.o1std=Fast (-O1)
Maple.menu.opt.o1std.build.flags.optimize=-O1
Maple.menu.opt.o1std.build.flags.ldspecs=
Maple.menu.opt.o1lto=Fast (-O1) with LTO
Maple.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Maple.menu.opt.o1lto.build.flags.ldspecs=-flto
Maple.menu.opt.o2std=Faster (-O2)
Maple.menu.opt.o2std.build.flags.optimize=-O2
Maple.menu.opt.o2std.build.flags.ldspecs=
Maple.menu.opt.o2lto=Faster (-O2) with LTO
Maple.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Maple.menu.opt.o2lto.build.flags.ldspecs=-flto
Maple.menu.opt.o3std=Fastest (-O3)
Maple.menu.opt.o3std.build.flags.optimize=-O3
Maple.menu.opt.o3std.build.flags.ldspecs=
Maple.menu.opt.o3lto=Fastest (-O3) with LTO
Maple.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Maple.menu.opt.o3lto.build.flags.ldspecs=-flto
Maple.menu.opt.ogstd=Debug (-g)
Maple.menu.opt.ogstd.build.flags.optimize=-g -Og
Maple.menu.opt.ogstd.build.flags.ldspecs=


KXKM_STM32F030.menu.opt.osstd=Smallest (-Os default)
KXKM_STM32F030.menu.opt.osstd.build.flags.optimize=-Os
KXKM_STM32F030.menu.opt.osstd.build.flags.ldspecs=
KXKM_STM32F030.menu.opt.oslto=Smallest (-Os) with LTO
KXKM_STM32F030.menu.opt.oslto.build.flags.optimize=-Os -flto
KXKM_STM32F030.menu.opt.oslto.build.flags.ldspecs=-flto
KXKM_STM32F030.menu.opt.o1std=Fast (-O1)
KXKM_STM32F030.menu.opt.o1std.build.flags.optimize=-O1
KXKM_STM32F030.menu.opt.o1std.build.flags.ldspecs=
KXKM_STM32F030.menu.opt.o1lto=Fast (-O1) with LTO
KXKM_STM32F030.menu.opt.o1lto.build.flags.optimize=-O1 -flto
KXKM_STM32F030.menu.opt.o1lto.build.flags.ldspecs=-flto
KXKM_STM32F030.menu.opt.o2std=Faster (-O2)
KXKM_STM32F030.menu.opt.o2std.build.flags.optimize=-O2
KXKM_STM32F030.menu.opt.o2std.build.flags.ldspecs=
KXKM_STM32F030.menu.opt.o2lto=Faster (-O2) with LTO
KXKM_STM32F030.menu.opt.o2lto.build.flags.optimize=-O2 -flto
KXKM_STM32F030.menu.opt.o2lto.build.flags.ldspecs=-flto
KXKM_STM32F030.menu.opt.o3std=Fastest (-O3)
KXKM_STM32F030.menu.opt.o3std.build.flags.optimize=-O3
KXKM_STM32F030.menu.opt.o3std.build.flags.ldspecs=
KXKM_STM32F030.menu.opt.o3lto=Fastest (-O3) with LTO
KXKM_STM32F030.menu.opt.o3lto.build.flags.optimize=-O3 -flto
KXKM_STM32F030.menu.opt.o3lto.build.flags.ldspecs=-flto
KXKM_STM32F030.menu.opt.ogstd=Debug (-g)
KXKM_STM32F030.menu.opt.ogstd.build.flags.optimize=-g -Og
KXKM_STM32F030.menu.opt.ogstd.build.flags.ldspecs=


################################################################################
# KXKM

KXKM_STM32F030.name=KXKM_STM32F030

#KXKM_STM32F030.build.vid=0x0483
#KXKM_STM32F030.build.pid=0x5711
#KXKM_STM32F030.vid.0=0x0483
#KXKM_STM32F030.pid.0=0x5711

KXKM_STM32F030.build.core=arduino
KXKM_STM32F030.build.board=KXKM_STM32F030
KXKM_STM32F030.build.extra_flags=-D{build.product_line} {build.xSerial}

# KXKM_F030F4 board
# Support: Serial1 (USART1 on PA10, PA9)
KXKM_STM32F030.menu.pnum.KXKM_F030F4=KXKM F030F4
KXKM_STM32F030.menu.pnum.KXKM_F030F4.node="NODE_F030F4,KXKM"
KXKM_STM32F030.menu.pnum.KXKM_F030F4.upload.maximum_size=16384
KXKM_STM32F030.menu.pnum.KXKM_F030F4.upload.maximum_data_size=4096
KXKM_STM32F030.menu.pnum.KXKM_F030F4.build.mcu=cortex-m0
KXKM_STM32F030.menu.pnum.KXKM_F030F4.build.board=KXKM_F030F4
KXKM_STM32F030.menu.pnum.KXKM_F030F4.build.series=STM32F0xx
KXKM_STM32F030.menu.pnum.KXKM_F030F4.build.product_line=STM32F030x6
KXKM_STM32F030.menu.pnum.KXKM_F030F4.build.variant=KXKM_STM32F030F4
KXKM_STM32F030.menu.pnum.KXKM_F030F4.build.cmsis_lib_gcc=arm_cortexM0l_math
